URLShortenerProgram/app/controllers/url_shortener_controller.rb

  def encode
    if params[:submit_button]
      @long_url = params[:input_long]
      s = "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ"
      loop do
        deci = rand(999999)
        hash = ""
        while deci > 0
          hash = s[deci % 62] + hash
          deci /= 62
        end

        @short_url = "https://short.est/" + hash

        if !UrlShortener.exists?(:short => @short_url)
          break
        end
      end

      UrlShortener.create(long: @long_url, short: @short_url)
      @url = UrlShortener.where(long: @long_url)
---
SELECT 1 AS one FROM "url_shorteners" WHERE "url_shorteners"."short" = ? LIMIT ?  [["short", "https://short.est/2Y6S"], ["LIMIT", 1]]
INSERT INTO "url_shorteners" ("long", "short", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["long", "https://www.washingtonpost.com/weather/"], ["short", "https://short.est/2Y6S"], ["created_at", "2023-05-03 19:35:56.054637"], ["updated_at", "2023-05-03 19:35:56.054637"]]
SELECT "url_shorteners".* FROM "url_shorteners" WHERE "url_shorteners"."long" = ?  [["long", "https://www.washingtonpost.com/weather/"]]

  def decode
    if params[:submit_button]
      @short_url = params[:input_short]
      @long_url = UrlShortener.where(short: @short_url).pluck(:long)
      if @long_url.empty?
        puts "short url does not exist. Please try again."
      end

      @url = UrlShortener.where(long: @long_url)
---
SELECT "url_shorteners"."long" FROM "url_shorteners" WHERE "url_shorteners"."short" = ?  [["short", "https://short.est/2xDp"]]
SELECT "url_shorteners".* FROM "url_shorteners" WHERE "url_shorteners"."long" = ?  [["long", "https://www.washingtonpost.com/"]]